{
  "projects": [
    {
      "image": "images/projects/mdh.png",
      "title": "MDH Environmental Public Health Tracking Portal",
      "bodyText": "Portal built for the Maryland Department of Health. Tracking aims to protect communities by providing federal, state, and local agencies with useful environmental and health data that can be used to plan, implement, and evaluate public health actions to prevent and manage environmentally-related diseases.  \n\nThe site is public facing and updated regularly, check it out with the link below!",
      "links": [
        {
          "text": "Live",
          "href": "https://maps.health.maryland.gov/ephtportal/"
        }
      ],
      "tags": [
        "React",
        "Leaflet",
        "JavaScript",
        "Material UI",
        ".NET",
        "C#",
        "SQl Server",
        "WCAG 2.0",
        "A11y"
      ]
    },
    {
      "image": "images/projects/mdn.png",
      "title": "Maryland Defense Network",
      "bodyText": "The Maryland Defense Network allows users to make meaningful connections, understand government contracting opportunities, grow business prospects, and assess the overall defense industry impact. \n\n The Maryland defense network collects data from several federal data sources as well as data collected directly by Maryland-based companies through the tool. Integration of the various sources fills in the gaps and provides a more complete picture of company data, and the analysis that is performed assists in the dissemination of the data through custom maps, reports, and tables.  Check this one out! ",
      "links": [
        {
          "text": "Live",
          "href": "https://marylanddefensenetwork.org/"
        }
      ],
      "tags": [
        "JavaScript",
        "React",
        "Esri JS SDK",
        "Bootstrap",
        "Node JS",
        "Express"
      ]
    },
    {
      "image": "images/projects/tigers.png",
      "title": "MDOT TIGERS Dashboard",
      "bodyText": "An internal dashboard used by MTA supervisors which provides mapping and data visualizations for Maryland Transit Administration (MTA) maintenance facilities, access to key documents, inspection compliance reporting, and stormwater compliance. \n\nThis project was originally built with Backbone JS and updated to use​ ReactJS and the newest version of the Esri JS SDK. \n\nAn additional module was added in 2024 that incorporated Esri's Survey 123 interface to allow for realtime inspections data to populate dedicated data displays.",
      "tags": [
        "JavaScript",
        "React",
        "Esri JS SDK",
        "Bootstrap",
        ".NET",
        "C#",
        "SQL Server"
      ]
    },
    {
      "image": "images/projects/campus.png",
      "title": "Towson Campus Map Reboot",
      "bodyText": "An update to the existing Towson campus map which was built in compliance with WCAG 2.0 standards to provide a streamlined and enjoyable UX for all end users.  \n\nUnlike other projects featured here, this was green field development where I was given complete control over the interface design, technology stack, and testing suite configuration. \n\nCheck it out!",
      "links": [
        {
          "text": "Live",
          "href": "https://www.towson.edu/maps/"
        }
      ],
      "tags": [
        "JavaScript",
        "React",
        "Material UI",
        "Esri JS SDK",
        "Google Earth API",
        "WCAG 2.0",
        "A11y"
      ]
    }
  ]
}
